import matplotlib.pyplot as plt
import numpy as np
plt.grid(True)
plt.xlabel('I, А')
plt.ylabel('V, В')
plt.title('График зависимости V=f(I)')

x = np.arange(0, 2, 0.01)
plt.plot(x, 5.615396918316574*x)
plt.plot(x,3.3188787579267682*x)
plt.plot(x,2.1737360398430425*x)

#график для 50 см
plt.plot([1.46, 1.13, 0.92,	0.64, 0.31, 0.15],[8.273, 6.360,	5.150, 3.570, 1.723, 0.825],'r.')
plt.plot([0.15,	0.31,	0.64,	0.92,	1.13,	1.46],[0.811,	1.716,	3.485,	5.090,	6.370,	8.224],  'b.')
#график для 30 см
plt.plot([1.47,	1.05,	0.86,	0.65,	0.44,	0.1], [4.872,	3.497,	2.856,	2.140,	1.440,	0.314],  'r.')
plt.plot([0.1,	0.36,	0.59,	0.79,	1.05,	1.47],[0.314,	1.169,	1.936,	2.615,	3.500,	4.900],  'b.')
#график для 20 см
plt.plot([0.62,	0.49,	0.4,	0.31,	0.19,	0.07], [1.340,	1.071,	0.870,	0.661,	0.415,	0.154], 'r.')
plt.plot([0.19,	0.32,	0.41,	0.49,	0.61,	0.9], [0.412,	0.689,	0.894,	1.058,	1.322,	1.970], 'b.')


plt.legend(['l=50см','l=30см','l=20см','убывающий ток','возрастающий ток'])
plt.show()